#include <iostream>
#include <cmath> //для натурального логорифма и арктангенса
#include <clocale>
using namespace std;

int main() {

    setlocale(LC_ALL, "Russian");

    double a = 0.1, b = 0.8, h = (b - a) / 10, eps = 0.0001;//создаем заданные переменные,а и б-границы х,h-шаг,епс-точность
    int n = 3;

    cout << "x |Точное значение |S(n=3) |S(eps) |кол-во срабатываний цикла" << endl;
    for (int i = 0; i <= 10; i++) { //перебор значений х (к было равно 10 по усл задачи)
        double x = a + i * h; //текущий х
        double y = 0.25 * log((1 + x) / (1 - x)) + 0.5 * atan(x); //вычисление точное значение функции по х
        //пунтк а
        double s1 = 0, t = x; //с=сумма результатов,т=текущее слагаемое(изначально просто х)
        for (int j = 0; j < n; j++) { //вычисление суммы ряда заданного н(3)
            s1 += t;//текущее слагаемое в сумму
            t *= x * x * x * x * (4.0 * j + 1) / (4.0 * j + 5); //умножаем текущее т на х**4 и дробь (4i+1)/(4i+5).Так мы получаем следующее слагаемое
        }
        //пункт б
        double s2 = 0; t = x; int k = 0;//s2 для точности,обновляем т,к-счетчик итераций
        while (t >= eps) {
            s2 += t;//прибавляем т к сумме
            t *= x * x * x * x * (4.0 * k + 1) / (4.0 * k + 5);//считаем следующее т
            k++;//увеличиваем счетчик
        }

        cout << x << " " << y << " " << s1 << " " << s2 << " " << k << endl;//выводим результаты
    }
    return 0;
}