#include <iostream>
#include <locale.h>
using namespace std;

int main() {



    //a(n-ая)=10**n/a!(факториал)
    //a(n-1)=10**(n-1)/(n-1)!
    //разделив а(n) на a(n-1) выйдет 10/n
    //следовательно a(n)=a(n-1)*(10/n)
    setlocale(LC_ALL, "Russian"); // Для вывода русского текста в консоли

    double e = 0.0001; //Заданная точность 4 знака полсе точки
    double a = 10.0;     //Первый член ряда при n = 1 (10**1 / 1! = 10)
    double sum = 0.0;    //счетчик суммы
    int n = 1;           //

    //Цикл работает, пока текущий член ряда больше или равен е
    //проверяем a >= e
    while (a >= e) {
        sum += a;       //Добавляем текущий член к сумме
        n++;            //Увеличиваем n для следующего шага
        a *= 10.0 / n;  //Вычисляем следующий член по рекуррентной формуле
    }

    //Вывод результата
    cout << "Сумма ряда с точностью " << e << " равна: " << sum << endl;
    cout << "Количество учтенных членов ряда: " << n - 1 << endl;

    return 0;
}